In [1]:
import pandas as pd
One simple way to store (or serialize) data in binary format is using Python’s built-in pickle module. pandas objects all have a to_pickle method that writes the data to disk in pickle formatimport numpy as np

In [2]:
frame=pd.read_csv("ex1.csv")
frame

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [4]:
frame.to_pickle("frame_pickle")

In [5]:
pd.read_pickle("frame_pickle")

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

Reading microsoft excel files

In [7]:
xlsx=pd.ExcelFile("ex1_excel.xlsx")
xlsx

In [8]:
xlsx.sheet_names

['Sheet1']

In [9]:
xlsx.parse(sheet_name="Sheet1")

   Unnamed: 0  a   b   c   d message
0           0  1   2   3   4   hello
1           1  5   6   7   8   world
2           2  9  10  11  12     foo

In [10]:
xlsx.parse(sheet_name="Sheet1",index_col=0)

   a   b   c   d message
0  1   2   3   4   hello
1  5   6   7   8   world
2  9  10  11  12     foo

In [11]:
writer = pd.ExcelWriter("ex2.xlsx")

In [12]:
frame.to_excel(writer,"Sheet1")

In [13]:
writer.close()

Using HDF5 format

In [15]:
frame = pd.DataFrame({"a": np.random.standard_normal(100)})
frame

           a
0  -0.555990
1  -1.150241
2   0.038726
3   1.318792
4  -1.011244
..       ...
95  0.645505
96 -0.038916
97 -1.623827
98  0.015935
99  1.319118

[100 rows x 1 columns]

In [16]:
store = pd.HDFStore("mydata.h5")

In [17]:
store["obj1"] = frame

In [18]:
store["obj1_col"] = frame["a"]

In [19]:
store

<class 'pandas.io.pytables.HDFStore'>
File path: mydata.h5

In [20]:
store["obj1"]

           a
0  -0.555990
1  -1.150241
2   0.038726
3   1.318792
4  -1.011244
..       ...
95  0.645505
96 -0.038916
97 -1.623827
98  0.015935
99  1.319118

[100 rows x 1 columns]

In [21]:
store.put("obj2", frame, format="table")

In [22]:
store.select("obj2", where=["index >= 10 and index <= 15"])

           a
10  0.631764
11  1.048030
12 -0.735824
13  0.026419
14  1.060033
15  0.102922

In [23]:
store.close()

In [24]:
frame.to_hdf("mydata.h5", "obj3", format="table")

In [26]:
pd.read_hdf("mydata.h5","obj3",where=["index<5"])

          a
0 -0.555990
1 -1.150241
2  0.038726
3  1.318792
4 -1.011244

In [27]:
#If you'd like, you can delete the HDF5 file you created, like so:

import os
os.remove("mydata.h5")